<a href="https://colab.research.google.com/github/Shireen-Naaz/Development-of-Interactive-Cyber-Threat-Visualization-Dashboard/blob/main/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***STRUCTURED QUERY LANGUAGE***

 Structured Query Language (SQL) is the standard language used to interact with relational databases.

Mainly used to manage data. Whether you want to create, delete, update or read data, SQL provides commands to perform these operations.
Widely supported across various database systems like MySQL, Oracle, PostgreSQL, SQL Server and many others.
Mainly works with Relational Databases (data is stored in the form of tables)

Writing First SQL Query:

In [ ]:
-- Example: Table structure
CREATE TABLE Students (
    ID INT,
    Name VARCHAR(50),
    Age INT
);

# ***SQL Overview***

SQL (Structured Query Language) is used to interact with relational databases—retrieving, modifying, and managing data.

In [ ]:
SELECT * FROM Students;

# ***Data Types***

SQL supports different data types for columns, such as numeric, character, and date types.

| Data Type | Description          | Example            |
| --------- | -------------------- | ------------------ |
| INT       | Integer numbers      | `Age INT`          |
| VARCHAR   | Variable-length text | `Name VARCHAR(50)` |
| CHAR      | Fixed-length text    | `Code CHAR(5)`     |
| DATE      | Date values          | `DOB DATE`         |
| FLOAT     | Decimal numbers      | `Salary FLOAT`     |
| BOOLEAN   | True/False values    | `IsActive BOOLEAN` |

# ***Basic SQL Commands (DML & DDL)***

##**DML (Data Manipulation Language):**

Commands to define or modify database structure (CREATE, ALTER, DROP,TRUNCATE).

**CREATE:**

Used to create database objects like tables, views, and indexes.

In [ ]:
CREATE TABLE Employees (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50)
);

 **ALTER:**

Modify an existing table’s structure.

In [ ]:
ALTER TABLE Employees ADD COLUMN salary DECIMAL(10,2);

**DROP:**

Delete database objects permanently.

In [ ]:
DROP TABLE Employees;

**TRUNCATE:**

Delete all records from a table but keep structure.

In [ ]:
TRUNCATE TABLE Employees;

##**DDL (Data Manipultive Language):**

Commands to manipulate data (SELECT, INSERT, UPDATE, DELETE).

**SELECT:**

Retrieve data from tables.

In [ ]:
SELECT name, enrollment_date FROM Students;

**INSERT:**

Add new records into tables.

In [ ]:
INSERT INTO Students (id, name, enrollment_date, is_active)
VALUES (1, 'Alice', '2026-02-13', TRUE);

**UPDATE:**

Modify existing records.

In [ ]:
UPDATE Students SET is_active = FALSE WHERE id = 1;

**DELETE:**

Remove records from a table.

In [ ]:
DELETE FROM Students WHERE id = 1;

##**Data Control Language (DCL)**

**GRANT:**

Provide privileges to users.

In [ ]:
GRANT SELECT, INSERT ON Students TO 'user1';

**REVOKE:**

Remove privileges from users.

In [ ]:
REVOKE INSERT ON Students FROM 'user1';

##**Transaction Control Language (TCL)**

**COMMIT:**

Save all changes made in the current transaction.

In [ ]:
COMMIT;

**ROLLBACK:**

Undo changes made in the current transaction.

In [ ]:
ROLLBACK;

# ***Clauses in SQL***

##**WHERE**

Filter records based on conditions.

In [ ]:
SELECT * FROM Students WHERE is_active = TRUE;

##**ORDER BY**

Sort results ascending or descending.

In [ ]:
SELECT * FROM Students ORDER BY name ASC;

##**GROUP BY**

Group records for aggregation.

In [ ]:
SELECT is_active, COUNT(*) FROM Students GROUP BY is_active;

##**HAVING**

Filter groups (used with GROUP BY).

In [ ]:
SELECT is_active, COUNT(*)
FROM Students
GROUP BY is_active
HAVING COUNT(*) > 1;

# ***Functions***

##**Aggregate Functions**

Perform calculations on multiple rows.

In [ ]:
SELECT COUNT(*), AVG(salary) FROM Employees;

##**Scalar Functions**

Perform operations on single values.

In [ ]:
SELECT UPPER(name), LENGTH(name) FROM Students;

# ***Joins***

##**INNER JOIN**

Return matching rows from both tables.

In [ ]:
SELECT e.emp_name, d.dept_name
FROM Employees e
INNER JOIN Departments d ON e.dept_id = d.dept_id;

##**LEFT JOIN**

All rows from left table + matching from right.

In [ ]:
SELECT e.emp_name, d.dept_name
FROM Employees e
LEFT JOIN Departments d ON e.dept_id = d.dept_id;

##**RIGHT JOIN / FULL JOIN / CROSS JOIN / SELF JOIN**

In [ ]:
SELECT e.emp_name, d.dept_name
FROM Employees e
RIGHT JOIN Departments d ON e.dept_id = d.dept_id;

# *Subqueries*

A subquery is a query nested inside another SQL query to provide intermediate results, which the outer query can use for filtering, comparison, or computation.

| **Type of Subquery**         | **Definition**                                                                                        |
| ---------------------------- | ----------------------------------------------------------------------------------------------------- |
| **Single-row Subquery**      | Returns **only one row and one column**. Typically used with comparison operators like `=`, `<`, `>`. |
| **Multiple-row Subquery**    | Returns **multiple rows**. Often used with operators like `IN`, `ANY`, or `ALL`.                      |
| **Multiple-column Subquery** | Returns **multiple columns**. Used for comparing tuples or in combination with `IN`.                  |
| **Correlated Subquery**      | Depends on the **outer query**; executed once for each row of the outer query.                        |
| **Nested Subquery**          | A subquery **inside another subquery**, potentially with multiple levels of nesting.                  |

In [ ]:
-- Sample tables
CREATE TABLE Students (
    id INT,
    name VARCHAR(50),
    enrollment_date DATE,
    is_active BOOLEAN
);

CREATE TABLE Employees (
    emp_id INT,
    emp_name VARCHAR(50),
    dept_id INT,
    salary DECIMAL(10,2)
);

CREATE TABLE Departments (
    dept_id INT,
    dept_name VARCHAR(50)
);

-- Insert sample data
INSERT INTO Students VALUES
(1, 'Alice', '2026-01-10', TRUE),
(2, 'Bob', '2026-02-01', TRUE),
(3, 'Charlie', '2026-01-20', FALSE);

INSERT INTO Departments VALUES
(10, 'HR'),
(20, 'Finance');

INSERT INTO Employees VALUES
(101, 'David', 10, 5000),
(102, 'Eve', 20, 6000),
(103, 'Frank', 10, 5500);

-----------------------------------
-- 1. Single-row Subquery
SELECT name
FROM Students
WHERE id = (SELECT MAX(id) FROM Students);

-- 2. Multiple-row Subquery
SELECT name
FROM Students
WHERE id IN (SELECT id FROM Students WHERE is_active = TRUE);

-- 3. Multiple-column Subquery
SELECT emp_name
FROM Employees
WHERE (dept_id, salary) IN (
    SELECT dept_id, MAX(salary)
    FROM Employees
    GROUP BY dept_id
);

-- 4. Correlated Subquery
SELECT name
FROM Students s1
WHERE id = (
    SELECT MAX(id)
    FROM Students s2
    WHERE s1.is_active = s2.is_active
);

-- 5. Nested Subquery
SELECT name
FROM Students
WHERE id IN (
    SELECT id
    FROM Students
    WHERE is_active = TRUE
    AND id IN (
        SELECT id
        FROM Students
        WHERE enrollment_date > '2026-01-15'
    )
);

# ***Indexes***

An index is a database object that improves the speed of data retrieval operations on a table. It works like a “lookup table” that allows the database to find rows faster, without scanning the entire table.

| **Type of Index**                  | **Definition**                                                                                                       |
| ---------------------------------- | -------------------------------------------------------------------------------------------------------------------- |
| **Primary Key Index**              | Automatically created when a `PRIMARY KEY` is defined; ensures **uniqueness** and fast lookup on the primary column. |
| **Unique Index**                   | Ensures all values in a column or combination of columns are **unique**.                                             |
| **Composite (Multi-column) Index** | Index created on **multiple columns** to speed up queries involving them together.                                   |
| **Full-text Index**                | Specialized index to optimize **text search** in large text columns (e.g., `VARCHAR` or `TEXT`).                     |
| **Clustered Index**                | Sorts and stores the **table rows physically** according to the index order. Only one per table.                     |
| **Non-Clustered Index**            | Logical index that **points to table rows** without changing physical order. Can have multiple per table.            |

In [ ]:
-- Create sample tables
CREATE TABLE Students (
    id INT,
    name VARCHAR(50),
    enrollment_date DATE,
    PRIMARY KEY(id)  -- Primary Key Index
);

CREATE TABLE Employees (
    emp_id INT,
    emp_name VARCHAR(50),
    dept_id INT,
    salary DECIMAL(10,2)
);

-- 1. Unique Index
CREATE UNIQUE INDEX idx_unique_name ON Students(name);

-- 2. Composite (Multi-column) Index
CREATE INDEX idx_name_enroll ON Students(name, enrollment_date);

-- 3. Full-text Index (MySQL/PostgreSQL)
CREATE FULLTEXT INDEX idx_fulltext_name ON Employees(emp_name);

-- 4. Clustered Index (SQL Server/MySQL InnoDB uses PK as clustered)
CREATE CLUSTERED INDEX idx_emp_id ON Employees(emp_id);

-- 5. Non-Clustered Index
CREATE INDEX idx_salary ON Employees(salary);

# *Views*

A view is a virtual table created by a SELECT query. It does not store data physically (except for materialized views) and is used to simplify queries, enhance security, or present aggregated data.

| **Type of View**      | **Definition**                                                                          |
| --------------------- | --------------------------------------------------------------------------------------- |
| **Simple View**       | Based on a **single table** and does not contain functions or groupings.                |
| **Complex View**      | Based on **multiple tables**, can include joins, groupings, and aggregations.           |
| **Materialized View** | Stores the **query result physically**. Needs to be refreshed to reflect table changes. |

In [ ]:
-- Sample tables
CREATE TABLE Students (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    enrollment_date DATE,
    is_active BOOLEAN
);

CREATE TABLE Courses (
    course_id INT PRIMARY KEY,
    course_name VARCHAR(50)
);

CREATE TABLE Enrollments (
    student_id INT,
    course_id INT,
    PRIMARY KEY(student_id, course_id)
);

-- 1. Simple View
CREATE VIEW ActiveStudents AS
SELECT id, name
FROM Students
WHERE is_active = TRUE;

-- 2. Complex View
CREATE VIEW StudentCourseInfo AS
SELECT s.id AS student_id, s.name, c.course_name
FROM Students s
JOIN Enrollments e ON s.id = e.student_id
JOIN Courses c ON e.course_id = c.course_id;

-- 3. Materialized View (example syntax for PostgreSQL)
CREATE MATERIALIZED VIEW ActiveEnrollments AS
SELECT s.id AS student_id, s.name, c.course_name
FROM Students s
JOIN Enrollments e ON s.id = e.student_id
JOIN Courses c ON e.course_id = c.course_id
WHERE s.is_active = TRUE;

# ***Constraints***

A constraint is a rule applied to a column or table to enforce data integrity and correctness. Constraints prevent invalid data from being inserted or updated in a table.

##**PRIMARY KEY**

Uniquely identifies each row in a table. Only one primary key per table.

In [ ]:
CREATE TABLE Students (
    id INT PRIMARY KEY,
    name VARCHAR(50)
);

##**FOREIGN KEY**

Ensures a column’s value matches a value in another table, establishing a relationship between tables.

In [ ]:
CREATE TABLE Enrollments (
    student_id INT,
    course_id INT,
    FOREIGN KEY (student_id) REFERENCES Students(id)
);

##**UNIQUE KEY**

Ensures all values in a column (or combination of columns) are distinct.

In [ ]:
CREATE TABLE Employees (
    emp_id INT,
    emp_email VARCHAR(100) UNIQUE
);

##**NOT NULL**

Ensures that a column cannot have NULL values.

In [ ]:
CREATE TABLE Courses (
    course_id INT,
    course_name VARCHAR(50) NOT NULL
);

##**CHECK**

Ensures that values in a column meet a specified condition.

In [ ]:
CREATE TABLE Employees (
    emp_id INT,
    salary DECIMAL(10,2),
    CHECK (salary > 0)
);

##**DEFAULT**

Assigns a default value to a column when no value is provided.

In [ ]:
CREATE TABLE Students (
    id INT,
    name VARCHAR(50),
    is_active BOOLEAN DEFAULT TRUE
);

##**COMPOSITE CONSTRAINTS**

Apply constraints to multiple columns together, e.g., a composite primary key.

In [ ]:
CREATE TABLE Enrollments (
    student_id INT,
    course_id INT,
    PRIMARY KEY (student_id, course_id)
);

# ***Stored Procedures***

Predefined SQL code blocks.

In [ ]:
CREATE PROCEDURE GetActiveStudents()
BEGIN
  SELECT * FROM Students WHERE is_active = TRUE;
END;

# ***Triggers***

A trigger is a special stored program that automatically executes when a specified event (INSERT, UPDATE, or DELETE) occurs on a table.
Triggers are used for validation, logging, auditing, and enforcing business rules.

| **Type of Trigger**    | **Definition**                                                                                                           |
| ---------------------- | ------------------------------------------------------------------------------------------------------------------------ |
| **BEFORE Trigger**     | Executes **before** the triggering event occurs. Commonly used for validation or modifying data before insertion/update. |
| **AFTER Trigger**      | Executes **after** the triggering event occurs. Commonly used for logging or auditing changes.                           |
| **INSTEAD OF Trigger** | Executes **instead of** the triggering event. Mostly used with views to control data modifications.                      |

In [ ]:
CREATE TABLE Employees (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50),
    salary DECIMAL(10,2)
);

CREATE TABLE Employee_Log (
    log_id INT AUTO_INCREMENT PRIMARY KEY,
    emp_id INT,
    action_type VARCHAR(20),
    action_time TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

-- BEFORE INSERT Trigger
DELIMITER //

CREATE TRIGGER before_employee_insert
BEFORE INSERT ON Employees
FOR EACH ROW
BEGIN
    -- Ensure salary is not negative
    IF NEW.salary < 0 THEN
        SET NEW.salary = 0;
    END IF;
END //

DELIMITER ;

-- AFTER INSERT Trigger
DELIMITER //

CREATE TRIGGER after_employee_insert
AFTER INSERT ON Employees
FOR EACH ROW
BEGIN
    INSERT INTO Employee_Log(emp_id, action_type)
    VALUES (NEW.emp_id, 'INSERT');
END //

DELIMITER ;

--INSTEAD OF Trigger (SQL Server Example)

CREATE TRIGGER instead_of_employee_insert
ON EmployeeView
INSTEAD OF INSERT
AS
BEGIN
INSERT INTO Employees(emp_id, emp_name, salary)
SELECT emp_id, emp_name, salary FROM inserted;
END;


INSERT INTO Employees VALUES (1, 'Alice', -5000);

# **Cursors**

A cursor is a database object used to retrieve and process rows one by one from a result set, mainly inside stored procedures or procedural SQL blocks.

| **Type of Cursor**  | **Definition**                                                                                                                       |
| ------------------- | ------------------------------------------------------------------------------------------------------------------------------------ |
| **Implicit Cursor** | Automatically created by the database when a DML statement (`INSERT`, `UPDATE`, `DELETE`) is executed. The user does not control it. |
| **Explicit Cursor** | Declared and controlled manually by the programmer to fetch and process rows one at a time.                                          |

In [ ]:
-- Sample table
CREATE TABLE Students (
    id INT,
    name VARCHAR(50),
    marks INT
);

INSERT INTO Students VALUES
(1, 'Alice', 85),
(2, 'Bob', 90),
(3, 'Charlie', 75);

-------------------------------------------------
-- 1️⃣ Implicit Cursor Example
-- Automatically handled by SQL engine
UPDATE Students
SET marks = marks + 5
WHERE id = 1;

-------------------------------------------------
-- 2️⃣ Explicit Cursor Example (MySQL)

DELIMITER //

CREATE PROCEDURE ProcessStudents()
BEGIN
    DECLARE done INT DEFAULT FALSE;
    DECLARE student_name VARCHAR(50);

    -- Declare cursor
    DECLARE student_cursor CURSOR FOR
        SELECT name FROM Students;

    -- Handle end of rows
    DECLARE CONTINUE HANDLER FOR NOT FOUND SET done = TRUE;

    -- Open cursor
    OPEN student_cursor;

    read_loop: LOOP
        FETCH student_cursor INTO student_name;

        IF done THEN
            LEAVE read_loop;
        END IF;

        -- Process each row
        SELECT student_name;
    END LOOP;

    -- Close cursor
    CLOSE student_cursor;
END //

DELIMITER ;

-- Call procedure
CALL ProcessStudents();

# ***Transactions***

A transaction is a sequence of one or more SQL statements executed as a single logical unit of work.
A transaction ensures that either all operations succeed (COMMIT) or none of them are applied (ROLLBACK).

| **Property**    | **Definition**                                                                   |
| --------------- | -------------------------------------------------------------------------------- |
| **Atomicity**   | All operations in a transaction are completed successfully, or none are applied. |
| **Consistency** | The database remains in a valid state before and after the transaction.          |
| **Isolation**   | Transactions do not interfere with each other while executing.                   |
| **Durability**  | Once committed, changes are permanently saved even after system failure.         |

# **Normalization**

Normalization is the process of organizing data in a database to reduce redundancy (duplicate data) and improve data integrity.
It divides large tables into smaller related tables and defines relationships between them.

##**First Normal Form (1NF)**

Rule:

Table must have atomic (single) values.

No repeating groups or multiple values in a single column.

| StudentID | Name  | Subject |
| --------- | ----- | ------- |
| 1         | Alice | Math    |
| 1         | Alice | Science |

##**Second Normal Form (2NF)**

Rule:

Must be in 1NF

No partial dependency

Every non-key column must depend on the entire primary key

Split into:

Students Table
| StudentID | StudentName |

Enrollments Table
| StudentID | CourseID |

##**Third Normal Form (3NF)**

Rule:

Must be in 2NF

No transitive dependency

Non-key columns should depend only on the primary key

Split into:

Students Table

| StudentID | DeptID |

Departments Table

| DeptID | DeptName |

##**Boyce-Codd Normal Form (BCNF)**

Rule:

Stronger version of 3NF

Every determinant must be a candidate key

Used when 3NF still allows some anomalies.

# *Set Operations*

Set operations are used to combine the results of two or more SELECT queries.

The queries must have:
Same number of columns
Same or compatible data types
Same column order

##**UNION**

Combines results of two queries.Removes duplicate rows

In [ ]:
SELECT name FROM Students
UNION
SELECT name FROM Teachers;

##**UNION ALL**

Combines results of two queries. Keeps duplicate rows

In [ ]:
SELECT name FROM Students
UNION ALL
SELECT name FROM Teachers;

##**INTERSECT**

Returns only the common rows between two queries

In [ ]:
SELECT name FROM Students
INTERSECT
SELECT name FROM Alumni;

## ***EXCEPT (or MINUS in Oracle)***

Returns rows from first query that are not present in second query

In [ ]:
SELECT name FROM Students
EXCEPT
SELECT name FROM Alumni;